In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from pandas import Series,DataFrame

### 1生成Series

In [8]:
s1=Series(data=[1,2,3,4,5,6])
s1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [9]:
s2=Series(data=np.random.randint(0,100,size=5))#数据结构存储的是一个结构的 Series是1维的\ #自动生成隐士索引
s2

0    76
1    57
2    94
3    52
4     8
dtype: int32

In [14]:
s3=Series(data={'a':1,'b':2,'c':3}) #或者在外面命名一个dic字典
s3

a    1
b    2
c    3
dtype: int64

In [26]:
s4=Series([3,5,96],index=['maths','english','chemical']) #显示索引
s4

maths        3
english      5
chemical    96
dtype: int64

In [27]:
s4['maths'] #都表示一个意思，普通索引
s4[0] #位置索引
s4.maths

3

In [30]:
s4[0:1] #切片索引

maths    3
dtype: int64

In [36]:
s4.shape #因为是1维的返回的就是长度3
s4.size #返回元素个数3
s4.index #Index(['maths', 'english', 'chemical'], dtype='object')返回的就是索引
s4.values# 返回的就是数值数组 array([ 3,  5, 96], dtype=int64)

array([ 3,  5, 96], dtype=int64)

In [41]:
s5=Series([1,np.NaN,2,np.NaN,np.NaN])
s5

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
dtype: float64

In [47]:
s5.isnull() #先取布尔值

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [50]:
s5[s5.notnull()] #再带入布尔值索引选出要的值

0    1.0
2    2.0
dtype: float64

In [65]:
D1=DataFrame(np.random.randint(2,100,size=(6,8)),index=['a','d','n','c','h','k'])#默认隐士索引，如何
D1

    0   1   2   3   4   5   6   7
a  60   5  97  19  18  86  41  64
d  31  40  39  14  81  30  42  78
n  20  27  85  58  91  84  42  70
c  51  20  52  46   8  74  99  77
h  56  77  49  35  42  67  90  98
k  51  50  26  16  49  96  17  84

In [55]:
np.random.randint(2,100,size=(6,8))#区别，一个是二维数组，一个表格形式的二维数组有行列索引所以要区别开

array([[72, 90, 20, 97, 15, 25, 31, 61],
       [66, 67, 57, 34, 65, 88, 68, 32],
       [74, 61, 38, 36, 46, 51, 14, 83],
       [26, 38, 53, 23, 84, 95, 48, 30],
       [51,  5, 52, 50, 94, 25, 79, 21],
       [33, 59, 66, 47, 68, 99,  7, 23]])

## 2 索引操作

- 取单列  df[col]
- 取多列  df[[col1,col2]]
- 取单行  df.loc[index]
- 取多行  df.loc[[index1,index2]]
- 取元素  df.loc[index,col] #loc都是普通索引，要找到对标的行索引标题，和列索引标题，位置索引就要加iloc
- 切片索引：
  - df[index1:index3]切行
  - df.loc[:,col1:col3]切列

## 3 时间序列

In [4]:
dic={ 'time':['2018-11-02','2020-05-16','2005-06-03'],
     'salary':['1111','2222','3333']
    
}
df=DataFrame(dic)

In [6]:
df.dtypes

time      object
salary    object
dtype: object

In [7]:
pd.to_datetime(df['time']) #转换成时间序列

0   2018-11-02
1   2020-05-16
2   2005-06-03
Name: time, dtype: datetime64[ns]

再重新赋值给df【time】

In [8]:
df['time']=pd.to_datetime(df['time'])
df

        time salary
0 2018-11-02   1111
1 2020-05-16   2222
2 2005-06-03   3333

In [9]:
df.dtypes

time      datetime64[ns]
salary            object
dtype: object

In [12]:
df.set_index(['time']) #改变行索引

           salary
time
2018-11-02   1111
2020-05-16   2222
2005-06-03   3333

In [22]:
df.set_index(['time']).reset_index()#这里运用重置索引将时间作为索引改成列索引 和后面删除效果其实差不多的

        time salary
0 2018-11-02   1111
1 2020-05-16   2222
2 2005-06-03   3333

In [17]:
df.set_index(df['time'])

                 time salary
time
2018-11-02 2018-11-02   1111
2020-05-16 2020-05-16   2222
2005-06-03 2005-06-03   3333

In [15]:
df1=df.set_index(df['time'])

In [16]:
df1.drop(labels='time',axis=1)#横向方向删除

           salary
time
2018-11-02   1111
2020-05-16   2222
2005-06-03   3333

In [21]:
df1.drop(labels='time',axis=1).reset_index()#这里运用重置索引将时间作为索引改成列索引

        time salary
0 2018-11-02   1111
1 2020-05-16   2222
2 2005-06-03   3333